# AnalyticalMemberRotation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticalMemberRotation Property
ParameterTypeId Class See Also
---
"Cross-Section Rotation": Used for Analytical Member
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticalMemberRotation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalMemberRotation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticalMemberRotation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace